In [1]:
# importing libraries
import pandas as pd

In [2]:
# dataframes
df1 = pd.DataFrame({
    "id": [1, 2, 3],
    "name": ["A", "B", "C"]
})

df2 = pd.DataFrame({
    "id": [2, 3, 4],
    "salary": [50000, 60000, 70000]
})

MERGING DATAFRAMES

In [3]:
# inner merge (keeps only common rows)
pd.merge(df1, df2, on="id", how="inner")

   id name  salary
0   2    B   50000
1   3    C   60000

In [4]:
# left merge (all rows from left dataframe)
pd.merge(df1, df2, on="id", how="left")

   id name   salary
0   1    A      NaN
1   2    B  50000.0
2   3    C  60000.0

In [5]:
# right merge (all rows from right dataframe)
pd.merge(df1, df2, on="id", how="right")

   id name  salary
0   2    B   50000
1   3    C   60000
2   4  NaN   70000

In [6]:
# outer merge (all rows from both tables)
pd.merge(df1, df2, on="id", how="outer")

   id name   salary
0   1    A      NaN
1   2    B  50000.0
2   3    C  60000.0
3   4  NaN  70000.0